{"page":1,"total_results":42,"total_pages":3,"results":[{"vote_count":1332,"id":7485,"video":false,"vote_average":6.9,"title":"Shooter","popularity":4.945098,"poster_path":"/wCZv0lNx58sfuLT698RYYJVEeTr.jpg","original_language":"en","original_title":"Shooter","genre_ids":[28,18,9648,53,80],"backdrop_path":"/wZ2u6C7Fw0DahC3Ilr3judpDWYO.jpg","adult":false,"overview":"A marksman living in exile is coaxed back into action after learning of a plot to kill the president. Ultimately double-crossed and framed for the attempt, he goes on the run to track the real killer and find out who exactly set him up, and why.","release_date":"2007-03-22"},{"vote_count":0,"id":261145,"video":false,"vote_average":0,"title":"Shooter","popularity":1.000661,"poster_path":null,"original_language":"en","original_title":"Shooter","genre_ids":[],"backdrop_path":null,"adult":false,"overview":"A war veteran is haunted by man's terrible inhumanity to man, but when he encounters the beauty of nature, he makes his choice of weapon","release_date":"2009-05-13"},{"vote_count":1,"id":291527,"video":false,"vote_average":5,"title":"Shooter","popularity":1.000032,"poster_path":"/3nZhlrIVays2KNRoq1YFQPQDUup.jpg","original_language":"en","original_title":"Shooter","genre_ids":[],"backdrop_path":null,"adult":false,"overview":"\"Shooter,\" aka Matt Thompson aka Gruwald is a photographer in 1967 Saigon, Vietnam. Working out of a news agency for a major magazine, Thompson gets involved in the lives of the soldiers he meets and \"shoots.\" There's Ngoc, the Vietnamese photo lab tech; Klause, a German photographer swiping Buddhas; Rene, a French photographer who carries an AK-47; Stork, Matt's superstitious roommate who is also a photographer; Rizzo, the irascible editor; Lan, an American-educated Vietnamese reporter and Tracey an embassy worker who is Matt's former flame.","release_date":"1988-09-11"},{"vote_count":42,"id":25126,"video":false,"vote_average":7.5,"title":"Six Shooter","popularity":1.278028,"poster_path":"/hBJTJi0SH4avrBr7OQqBZuYPvmA.jpg","original_language":"en","original_title":"Six Shooter","genre_ids":[35],"backdrop_path":"/rZ9ldd2osY94MMRWL80k9eL0OnB.jpg","adult":false,"overview":"A black and bloody Irish comedy about a sad train journey where an older man, whose wife has died that morning, encounters a strange and possibly psychotic young oddball...","release_date":"2004-01-01"},{"vote_count":0,"id":201753,"video":false,"vote_average":0,"title":"Headline Shooter","popularity":1.10107,"poster_path":"/xfVOSzWfSlxc0Jes34gWrjSxBZX.jpg","original_language":"en","original_title":"Headline Shooter","genre_ids":[12,18],"backdrop_path":"/lNNSb6bKflhXd16X4EBbAbC9wCC.jpg","adult":false,"overview":"A newsreel photographer neglects his love life to get the perfect shot.","release_date":"1933-07-28"},{"vote_count":1,"id":150823,"video":false,"vote_average":5,"title":"The Shooter","popularity":1.093976,"poster_path":"/vjG4mxkTw9Ftrf1Yv87dl0Sadim.jpg","original_language":"en","original_title":"The Shooter","genre_ids":[37],"backdrop_path":null,"adult":false,"overview":"The story is of a small town in the early west and of a 'shooter' of reputation that drifts into it and stands up to the controlling family that runs it. But far from a John Wayne, this hero is caught and brutally beaten and left to die, only to be saved by a prostitute that has also suffered under the hand of this group of desperados. The only one possible to stand up to the shooter is another solitary man who joins with the notorious family although he is deputized as the town's sherif.","release_date":"1997-10-23"},{"vote_count":34,"id":407375,"video":false,"vote_average":5.4,"title":"Sniper: Ghost Shooter","popularity":1.615508,"poster_path":"/sO61kOJEObDs8uOTkQLj5j8eaxu.jpg","original_language":"en","original_title":"Sniper: Ghost Shooter","genre_ids":[28,18,10752],"backdrop_path":"/zCkJNYEiO4wgGOmQx1FOH1hFCA9.jpg","adult":false,"overview":"Elite snipers Brandon Beckett and Richard Miller are tasked with protecting a gas pipeline from terrorists looking to make a statement. When battles with the enemy lead to snipers being killed by a ghost shooter who knows their exact location, tensions boil as a security breach is suspected. Is there someone working with the enemy on the inside? Is the mission a front for other activity? Is the Colonel pulling the strings?","release_date":"2016-08-02"},{"vote_count":4,"id":10224,"video":false,"vote_average":4.1,"title":"Straight Shooter","popularity":1.056423,"poster_path":"/7VYzNmxeERepBmMFHePH006dAaZ.jpg","original_language":"de","original_title":"Straight Shooter","genre_ids":[18,53],"backdrop_path":"/4qMTMqDvvLFoLvAkPfMDaJuDOfM.jpg","adult":false,"overview":"After his daughter died of cancer, former French foreign legionnaire \"Straight Shooter\" alias Volker Bretz threatens those who financed, built, favoured and now work the nuclear power plant Atar II to kill one of them each day until the plant is shut down. His former drill sergeant, Frank Hector, who now owns several night clubs and brothels, is the only one who might be able to stop the maniac killing specialist. Frank is flown in instantly, but soon has to find out that his former comrade's actions might be a result from an event long ago.","release_date":"1999-04-15"},{"vote_count":0,"id":242573,"video":false,"vote_average":0,"title":"Straight Shooter","popularity":1.00355,"poster_path":"/oEF0UsSF2vRQ4R8plY28oScZkwH.jpg","original_language":"en","original_title":"Straight Shooter","genre_ids":[37],"backdrop_path":"/8sP11awBcjOnUHXs6sDB3OAlZo0.jpg","adult":false,"overview":"Before he was killed, Martin hid a half million dollars worth of bonds on his ranch. Brainard, who killed him, Inspector Carson posing as Sam Brown, and Martin's niece Margaret all want the ranch, and it's being sold at auction.","release_date":"1939-08-12"},{"vote_count":0,"id":342280,"video":false,"vote_average":0,"title":"Square Shooter","popularity":1.002762,"poster_path":"/sDmDdvbHMFGN4OpaVbb4GjNCq8o.jpg","original_language":"en","original_title":"Square Shooter","genre_ids":[10749,37],"backdrop_path":null,"adult":false,"overview":"Tim returns from prison after being framed for murder to clear his name and retrieve the ranch taken from his uncle with a forged will.","release_date":"1935-01-21"},{"vote_count":17,"id":173603,"video":false,"vote_average":5.2,"title":"The Shooter","popularity":1.38811,"poster_path":"/dwPCOQEHItfgsFesSH0eORPMGuM.jpg","original_language":"da","original_title":"Skytten","genre_ids":[53,80,18,9648],"backdrop_path":"/71AM0ZXrlMlQtoIWpREeThuQYgN.jpg","adult":false,"overview":"The five days when Copenhagen was held in a panic grip by an intelligent activist and former elite shooter, who takes to arms when a woman journalist writes about the government’s broken promises in an environmental question.","release_date":"2013-02-27"},{"vote_count":9,"id":55261,"video":false,"vote_average":5.6,"title":"Hidden Assassin","popularity":1.673737,"poster_path":"/mBxL28j9Qm6yBsGsK9jNqX1erwO.jpg","original_language":"en","original_title":"Hidden Assassin","genre_ids":[28,53],"backdrop_path":"/h4yJJ8ZeufWpDmll6NaMx93MXT3.jpg","adult":false,"overview":"A CIA agent gets caught up in political intrigue after he gets brought in to solve the murder of a Cuban ambassador.","release_date":"1995-12-15"},{"vote_count":1,"id":404590,"video":false,"vote_average":10,"title":"The Dog Shooter","popularity":1.013531,"poster_path":"/5sIeg2n1kFlUaozo3CQEhi6yHGA.jpg","original_language":"tl","original_title":"Ringgo: The Dog-shooter","genre_ids":[18],"backdrop_path":null,"adult":false,"overview":"This is a story of the journey of 3 souls heading towards healing and redemption. RINGGO is a 16-year old boy who works as a dog-shooter (the one who assists in mating the dogs with breed -- he will see to it that the private parts of the stud and bitch will be locked during the mating and no sperm will be put to waste in the process).  Ringgo works for BONG, a 40-year old lesbian who is a breeder of dogs. One of Bong’s dogs is I’nca, who is a troubled Doberman. Things will get complicated when Ringgo, I’nca and Bong developed a relationship as if they were really mother and child, and get entangled in each other’s personal issues and becomes each other’s protector and defender.  The one that ties the three of them is that invisible umbilical cord... the cord of love and sacrifice.","release_date":"2016-07-01"},{"vote_count":6,"id":338752,"video":false,"vote_average":4.7,"title":"FPS: First Person Shooter","popularity":1.130166,"poster_path":"/aRaLJ1Xp5HjAbPaP59KyN7x6r1N.jpg","original_language":"en","original_title":"FPS: First Person Shooter","genre_ids":[27],"backdrop_path":"/AfmzRpR4CoT4WRYtMc4ZjQHLJub.jpg","adult":false,"overview":"Your pregnant wife Linda has been captured by a ruthless scientist, who created a devastating virus. To rescue her, you have to fight through the old rotten experimental clinic, armed to the teeth, one level after another right through the dark, decayed guts of this evil complex. unfortunately you don't have much time, at dawn, the whole area will be eradicated.","release_date":"2015-08-01"},{"vote_count":14,"id":58107,"video":false,"vote_average":6.6,"title":"Black Rock Shooter","popularity":1.141447,"poster_path":"/jE1oWVIkU4ZUi1sxgvW88pEcsSZ.jpg","original_language":"ja","original_title":"Burakku Rokku Shūtā","genre_ids":[28,16,18,14,53],"backdrop_path":"/xooauhb59PwKz2mYEAcRZ7vIFjW.jpg","adult":false,"overview":"Mato Kuroi just got into junior high school, and on the first day, someone catches her eye; her classmate Yomi Takanashi. The two meet.The innocent and naive Mato. The mature Yomi. Seemingly opposites, but the time they spend together only strengthens a growing friendship. But as they go into their second year at the school, they get placed in separate classes, and they begin to grow apart. But somewhere simultaneously... In another world, a young girl, blue fire residing in her eyes, Black Rock Shooter faces another young girl; this one holding a jet-black scythe, Dead Master, and a battle to the death begins to unfold.","release_date":"2010-07-24"},{"vote_count":0,"id":434450,"video":false,"vote_average":0,"title":"Respect the Shooter","popularity":1.019082,"poster_path":"/o9LB9tUsX2SKQmg3VP6viyBtgXy.jpg","original_language":"en","original_title":"Respect the Shooter","genre_ids":[99],"backdrop_path":null,"adult":false,"overview":"This documentary sets out to shed light on the melting pot which is London's young art scene...","release_date":"2017-01-26"},{"vote_count":0,"id":119704,"video":false,"vote_average":0,"title":"First Person Shooter","popularity":1.000986,"poster_path":null,"original_language":"en","original_title":"First Person Shooter","genre_ids":[99],"backdrop_path":null,"adult":false,"overview":"Filmmaker Robin Benger covered 14 wars in 24 countries as a veteran TV producer but nothing prepared him for the discovery that war was being waged in the basement of his own home.\r He discovered that \"first person shooter\" games, and violence-centred gaming, are taking over as the entertainment of choice for a whole generation of (mostly) teenage males. Entering into that world, he began filming in cyber-cafes, games manufacturers‚ conventions, and mega gaming tournaments, even tracking down the designer of the very game causing him so much friction with his own son.","release_date":"2002-09-01"},{"vote_count":0,"id":318495,"video":false,"vote_average":0,"title":"Shooter Series: Brett Ratner","popularity":1.00066,"poster_path":null,"original_language":"en","original_title":"Shooter Series: Brett Ratner","genre_ids":[],"backdrop_path":null,"adult":false,"overview":"Rounding up some of director Brett Ratner's most innovative short projects, this engaging documentary features many of his films from his days as a student at New York University, his big-budget commercials and his music videos. Ratner has collaborated with such superstar vocalists as Madonna, Mariah Carey, Lionel Richie and LL Cool J, while his cinematic oeuvre includes the überpopular Rush Hour franchise and X-Men: The Last Stand.","release_date":"2009-01-01"},{"vote_count":2,"id":47884,"video":false,"vote_average":8.3,"title":"Nancy Drew... Trouble Shooter","popularity":1.086826,"poster_path":"/hnVjvIvm1Vn7mnKx0NcNv5OGSq0.jpg","original_language":"en","original_title":"Nancy Drew... Trouble Shooter","genre_ids":[35,9648],"backdrop_path":"/keVH2kC7IR8uu7N271wJE0BjTZd.jpg","adult":false,"overview":"Nancy Drew clears her Uncle Matt of murder charges when she exposes the real murderers. She and Ted find themselves in many dangerous positions such as trying to fly an airplane after the pilot parachuted out and being face-to-face with the murderer.","release_date":"1939-06-17"},{"vote_count":1,"id":253062,"video":false,"vote_average":5,"title":"Anton Spelec, Sharp-Shooter","popularity":1.001616,"poster_path":"/1HztLqw7UXuvscQDLLxvkh3AS1Y.jpg","original_language":"en","original_title":"Anton Špelec, ostrostřelec","genre_ids":[],"backdrop_path":"/vStBueQjPAbjelJEy4mKitSZxG.jpg","adult":false,"overview":"Anton Špelec (Vlasta Burin) is a producer of musical instruments by trade but a sharp-shooter at heart. He expects to be awarded a medal at a large parade in town where veteran sharp-shooters will be honored. When the town council is one medal short, Anton must wait another year for his prized possession. He drowns his disappointment in drink at the local pub and becomes so drunk that he insults the emperor who sentences him to jail. Instead of fulfilling the emperor’s orders himself, Anton sends his employee in his stead.","release_date":"1932-12-16"}]}